tutorials/incompressible/pimpleDyMFoam/movingCylinders/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           CG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-03;
        relTol           0;
    }
    p
    {
        $p;
        solver           CG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0.0;
    }
    pFinal
    {
        $p;
        relTol           0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0;
    }

    UFinal
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors 2;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;

    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    equations
    {
        U               1;
        UFinal          1;
    }
    fields
    {}
}

fieldBounds
{
    p -1e4 1e4;
    U 20;
}

// ************************************************************************* //
